
{
    "posts": {
        "1": {
            "id": 1,
            "title": "my actual path to code",
            "when": "2023-11-19",
            "content": "!!! THIS IS JUST RAW TEXT WHAT I WRITING, IN FINAL IT WOULD BE OKEY !!! Hello people, now, here I will trying to answer my questions about my life nowadays like  how I learn code? Why I learn it? Is there better things then learning and writing code? Why now in these days people wants to be “software engineer”? What is that magic about it? Is it worth to put this enormous effort to it when so many people are trying to achieve the same goal while maybe you could be the best repairman in your town with same salary like skilled software engineer and had no fear about your future cause repairmen's  job is hard to replace with AI and robots. This and more waiting for you here in my journey across keyboard… 👾 Where can I begin? Okay, just for your information I’m not good writer, when I gave this text to ChatGPT to look at him what’s wrong, there was/is a lot of it. But I want do it my way, this are my thoughts and words, I want it my way. So, first I want talk about how I learn and learning to code. Basically by doing could be short answer I think. But now explanation right? I can see on myself that in the past or now in present I really like read and listen to interesting, for me new stuff and I realise after some time I couldn’t remember some things what I think I will know cause it was so interesting for me. And that’s is exactly what I think why I can’t remember coding stuff from only looking on it. I need do something with these knowledges immediately after or while I learning, reading it. That’s why I like websites like freeCodeCamp.com. I learn there by doing, and that is more valuable then anything else for me. Of course, when I learning new stuff or I need really understand something, the best solution for me is first check some good YouTube videos on that topic, second are blogs and documentation and least but not last ChatGPT or BARD for instance. From start of my intense learning in June ’23 I mainly used ChatGPT, but now in November I find BARD more valuable cause not restriction on data after Sep 2021, but I must admit, when I compare this two tools, BARD must evolve a lot to catch up with ChatGPT. And I admit, a lot of stuff is though to understand, to get under skin and really get logic of it, I think I need sometimes a lot of different approaches to finally understand something and don’t make silly errors. Now I thinking what was the last thing I doesn’t understand a longer time… IDK, nothing yet maybe, I mean when I don’t know something I google it and I get it in the future when I do that more times. Now why I learning do code. I like work on computer in some cozy coffeehouse, I like problem-solving, I like google stuff and learn new things a lot, I  like endorphins after I finally make something work as I wanted, I like to see something interesting is working in browser when before there was nothing, I like get in details of some problems. I think I am not good programmer now, but I see I have some qualities that predispose me to be by time good in it, I am highly motivated, I know what I want to do and how get there. It will be thought but if it was easy everybody will be doing it."
        },
        "2": {
            "id": 2,
            "title": "where i learning and how i learning",
            "when": "2023-09-05",
            "content": "here will be content, idk in what formath for now, blog 2"
        }
    }
}